# Используем официальный образ Python 3.12.9 в качестве базового 
FROM python:3.12.9

# Устанавливаем рабочую директорию внутри контейнера
WORKDIR /app

# Копируем файл с зависимостями в рабочую директорию
# Этот шаг выполняется отдельно для эффективного использования кэширования Docker
COPY requirements.txt .

# Устанавливаем зависимости, перечисленные в requirements.txt [cite: 3]
# Опция --no-cache-dir уменьшает размер итогового образа
RUN pip install --no-cache-dir -r requirements.txt

# Копируем все остальные файлы проекта (исходный код) в рабочую директорию
COPY . .

# Указываем команду, которая будет выполнена при запуске контейнера
# В данном случае, запускаем главный скрипт main.py
CMD ["python", "main.py"]